import { Section } from './types';

export const CLASS_DATA: Record<Section, { name: string; code: string; subjects: string[] }[]> = {
  [Section.BANIN_DARS_NIYAMI]: [
    { name: 'درجہ متوسطہ', code: '00', subjects: ['اردو', 'ریاضی', 'انگلش', 'سائنس', 'معاشرتی علوم', 'املاء'] },
    { name: 'درجہ اولیٰ', code: '01', subjects: ['نحو', 'صرف', 'فقہ', 'اجراءالنحو', 'اجراءالصرف', 'ادب'] },
    { name: 'درجہ ثانویہ عامہ', code: '02', subjects: ['ترجمہ وتفسیروتجويد', 'حديث ولغۃعربیہ', 'فقہ', 'صرف', 'نحو', 'منطق'] },
    { name: 'درجہ خاصہ سال اول', code: '03', subjects: ['ترجمہ وتفسیروحدیث', 'فقہ', 'اصول فقہ', 'نحو', 'منطق وعقائد', 'لغۃ عربیہ'] },
    { name: 'درجہ خاصہ سال دوم', code: '04', subjects: ['ترجمہ وتفسیرو حدیث', 'فقہ', 'اصول فقہ', 'نحو', 'لغۃ عربیہ', 'منطق وبلاغۃ'] },
    { name: 'درجہ عالیہ سال اول', code: '05', subjects: ['ترجمہ وتفسیروحدیث', 'فقہ', 'اصول فقہ', 'بلاغۃ', 'فلسفہ وعقائد', 'ادب'] },
    { name: 'درجہ عالیہ سال دوم', code: '06', subjects: ['تفسیر', 'حديث/اصول حديث/ فرائض', 'فقہ', 'اصول فقہ', 'عقائدوفلکيات', 'لغۃ عربيہ'] },
  ],
  [Section.BANAT_DARS_NIYAMI]: [
    { name: 'درجہ اعدادیہ', code: '00', subjects: ['لغت عربی', 'اردوکی پہلی', 'ریاضی', 'سیرت', 'اسلامی تعلیمات', 'اچھاقاعدہ'] },
    { name: 'درجہ متوسطہ', code: '00', subjects: ['تعلیم النساء', 'آسان نحو', 'آسان صرف', 'طریقہ جدیدہ', 'ریاضی', 'املاء'] },
    { name: 'درجہ خاصہ سال اول', code: '01', subjects: ['ترجمہ وتفسیر', 'حديث', 'فقہ وسيرت', 'صرف', 'نحو', 'لغت عربی'] },
    { name: 'درجہ خاصہ سال دوم', code: '02', subjects: ['ترجمہ وتفسیر', 'صرف', 'فقہ', 'اصول فقہ', 'نحو', 'منطق'] },
    { name: 'درجہ عالیہ سال اول', code: '03', subjects: ['ترجمہ وتفسیر', 'حديث', 'فقہ', 'اصول فقہ', 'بلاغۃ', 'ادب', 'عربی وعقائد'] },
    { name: 'درجہ عالیہ سال دوم', code: '04', subjects: ['تر جمہ وتفسیر', 'مشکوةج 1', 'مشکوةج 2/خيرالاصول', 'فقہ', 'اخلاق وتربيت', 'اصول تفسیروعقائد'] },
    { name: 'درجہ عالمیہ سال اول', code: '05', subjects: ['تفسیرجلالين', 'تيسيرمصطلح الحديث', 'ہدايہ ج2', 'طحاوى شریف', 'ترمذى ج 2', 'سنن ابی داؤدج1'] },
    { name: 'درجہ عالمیہ سال دوم', code: '06', subjects: ['صحيح بخارى ج2', 'صحيح مسلم ج1', 'جامع ترمذى ج1', 'صحيح بخارى ج1', 'ابو داؤد ج 2', 'صحيح مسلم ج2'] },
    { name: 'درجہ تجویدللعالمات', code: '07', subjects: ['تفہیم الوقوف', 'معلم التجوید', 'علوم القراءت', 'حدر', 'حفظ', 'اجراء قواعد التجوید'] },
  ],
  [Section.BANIN_HIFZ]: [
    { name: 'ناظرہ', code: '01', subjects: [] },
    { name: 'حفظ', code: '02', subjects: [] },
    { name: 'دور', code: '03', subjects: [] },
  ]
};

export const SECTION_PREFIXES: Record<Section, string> = {
  [Section.BANIN_DARS_NIYAMI]: 'DN',
  [Section.BANAT_DARS_NIYAMI]: 'BN',
  [Section.BANIN_HIFZ]: 'DH'
};
